// TextManager
// Token: 0x0600023A RID: 570 RVA: 0x0003343C File Offset: 0x0003163C
public void GetDataByKR()
{
	this.systemTextDic_KR = new Dictionary<int, string>();
	this.itemsTextDic_KR = new Dictionary<int, string>();
	this.talkTextDic_KR = new Dictionary<int, string>();
	this.systemTextDic_KR.Add(-100, "I");
	this.systemTextDic_KR.Add(-101, "II");
	this.systemTextDic_KR.Add(-102, "III");
	this.systemTextDic_KR.Add(-103, "IV");
	this.systemTextDic_KR.Add(-104, "V");
	this.systemTextDic_KR.Add(-105, "VI");
	this.systemTextDic_KR.Add(-106, "VII");
	this.systemTextDic_KR.Add(-107, "VIII");
	this.systemTextDic_KR.Add(-108, "IX");
	this.systemTextDic_KR.Add(-109, "X");
	this.systemTextDic_KR.Add(-110, "XI");
	this.systemTextDic_KR.Add(-111, "XII");
	this.systemTextDic_KR.Add(-112, "XIII");
	this.systemTextDic_KR.Add(-113, "XIV");
	this.systemTextDic_KR.Add(-114, "XV");
	this.systemTextDic_KR.Add(-115, "XV");
	this.systemTextDic_KR.Add(-116, "방어 모드");
	this.systemTextDic_KR.Add(-117, "위시리스트에 추가");
	this.systemTextDic_KR.Add(-118, "후퇴");
	this.systemTextDic_KR.Add(0, "새 게임");
	this.systemTextDic_KR.Add(1, "게임 계속하기");
	this.systemTextDic_KR.Add(2, "전역");
	this.systemTextDic_KR.Add(3, "음악");
	this.systemTextDic_KR.Add(4, "효과음");
	this.systemTextDic_KR.Add(5, "인형 소리");
	this.systemTextDic_KR.Add(6, "화면 나갈 때 음소거");
	this.systemTextDic_KR.Add(7, "자동 저장 간격");
	this.systemTextDic_KR.Add(8, "탄막 투명도");
	this.systemTextDic_KR.Add(9, "드래그 속도");
	this.systemTextDic_KR.Add(10, "마우스 크기");
	this.systemTextDic_KR.Add(11, "마우스 효과");
	this.systemTextDic_KR.Add(12, "책 투명도");
	this.systemTextDic_KR.Add(13, "화면 흔들림");
	this.systemTextDic_KR.Add(14, "스크린 효과");
	this.systemTextDic_KR.Add(15, "언어");
	this.systemTextDic_KR.Add(16, "전체 화면 모드");
	this.systemTextDic_KR.Add(17, "코코로의 팝업 알림");
	this.systemTextDic_KR.Add(18, "최고 기록:\n");
	this.systemTextDic_KR.Add(19, "게임을 종료하시겠습니까？");
	this.systemTextDic_KR.Add(50, "데미지");
	this.systemTextDic_KR.Add(51, "회수");
	this.talkTextDic_KR.Add(-2, "[F2] 알림 닫기\n[마우스 오른쪽 버튼]으로 시점 이동\n[마우스 휠]으로 시점 확대/축소\n[TAB]으로 회의 화면 열기\n[H] 도감 열기");
	this.talkTextDic_KR.Add(-1, "게임 저장 중입니다. 게임을 종료하지 마십시오\n");
	this.talkTextDic_KR.Add(-3, "앨리스 마르가트로이드");
	this.talkTextDic_KR.Add(-4, "무우우 기리사메");
	this.talkTextDic_KR.Add(-5, "하쿠레이 레이무");
	this.talkTextDic_KR.Add(-6, "동방프로젝트 팬메이드 이차 창작 작품\n\n원작: 동방프로젝트 / 샹하이 앨리스 판타지오르케스트라 / ZUN");
	this.talkTextDic_KR.Add(-7, "[F1] 코코로 인형 조종／조종 해제\n[W/A/S/D] 이동\n[마우스 왼쪽 클릭] 공격／연격 공격, 마지막 타격 시 초록색 B포인트 드롭으로 자신의 영력을 충전\n[스페이스 바] 대시, 동시에 모든 공격 회피");
	this.talkTextDic_KR.Add(-8, "[F] 영력 80 소모로 [희] 마스크 상태 부가. 자신과 모든 인형의 데미지 100% 상승, 자신의 공격 속도도 상승. 동시에 대시 시 분노의 기랑의 얼굴을 발동해 데미지를 주고, 대시 거리도 더 멀어짐.\n[Q] 영력 15 소모로 [노] 마스크 상태 부가. 기간 중 일반 공격 연격을 마지막 단계까지 이어가면, 특수한 4단 연격「비행 도광」을 추가 발동.");
	this.talkTextDic_KR.Add(-9, "[E] 영력 30 소모로 [애] 마스크 상태 부가. 기간 중 쉴드 개방. 쉴드 범위 내 모든 인형은 모든 데미지를 면역하며, 동시에 쉴드가 접촉한 기리사메의 탄막을 모두 파괴.\n[R] 영력 35 소모로 [락] 마스크 상태 부가. 공격을 빠른 다단 베기로 변경해 대량 데미지를 주는 동시에 기리사메의 행동을 차단하고 현기증을 유발.");
	this.talkTextDic_KR.Add(-10, "숨겨진 캐릭터 잠금 해제\n");
	this.talkTextDic_KR.Add(-11, "삽을 획득했다. 부드러운 곳에서 뭔가를 파낼 수 있는 것 같다");
	this.talkTextDic_KR.Add(-12, "저주 인형이 어떤 인형에게 저주를 걸었다. 그 인형은 이제 분해되었고, 해당 개수의 상하이 인형을 돌려받았다");
	this.talkTextDic_KR.Add(-13, "당신의 꽃이 드문 방문객을 끌어들였다");
	this.talkTextDic_KR.Add(-14, "차가운 기운이 돌다…… 파손된 저택은 가난신을 끌어당기는 것 같다. 전투를 시작하면 만나게 될 것이다");
	this.talkTextDic_KR.Add(-15, "기리사메는 알맞은 대가를 치렀다. 모두가 모든 책을 되찾았다\n\n\n게임 클리어, 플레이해주셔서 감사합니다!\n\n\n클리어 시간 ");
	this.talkTextDic_KR.Add(-16, "\n\n\n\n\n—————————제작 스태프—————————\n\n\n아트\n\nNarrow\n\n\n\n프로그래밍\n\nTSUKUYOMIC\n\n\n\n음악\n\nSKM 붉은 실내 오케스트라\n\nAnsue");
	this.talkTextDic_KR.Add(-17, "구경하던 밤새가 이곳에서 일어나는 일에 호기심을 보이고 있다. 어떤 축제라고 생각해서 아래에 자리 잡았나보다");
	this.talkTextDic_KR.Add(-18, "기리사메 집 위치에 약점이 나타났다. 해당 약점을 클릭하면 순간적으로 높은 데미지를 입힐 수 있다");
	this.talkTextDic_KR.Add(-19, "왜 아직 사람이 있죠! 안 돼요!");
	this.talkTextDic_KR.Add(-20, "이곳은 어디지……");
	this.talkTextDic_KR.Add(-21, "그래……\n이곳은 다른 게임인 것 같아……");
	this.talkTextDic_KR.Add(-22, "제 이름은 코코로! 모든 감정을 지배하는 가면의 영혼이에요!\n이렇게 소개해야 할까요……");
	this.talkTextDic_KR.Add(-23, "그래…… 이건 크로스오버야!\n어쨌든 [마리사! 책을 돌려줘!]가 [동방블루밍 소울]과 콜라보했기 때문에, 저는 여기에 나타났어……");
	this.talkTextDic_KR.Add(-24, "그리고 여기 오는 길에 다시 희망의 마스크를 잃어버렸어……\n희망의 마스크를 찾지 않으면, 이대로 갈 수 없어……");
	this.talkTextDic_KR.Add(-25, "여기에 희망에 가득 찬 사람들이 많은 것 같아……\n당신의 희망을 내게 주세요!");
	this.talkTextDic_KR.Add(-26, "이상한 사람……\n하지만 당신이 내 희망을 빼앗고 싶다고? 재미있다. 난 그냥 앉아있기만 할 순 없어!");
	this.talkTextDic_KR.Add(-86, "기리사메가 던지는 병과 팔괘로는 마우스 클릭으로 파괴하여 막을 수 있다");
	this.talkTextDic_KR.Add(-87, "기리사메의 책 반납 현장에 오신 것을 환영합니다! 오늘 모두 기세가 몰려, 기리사메에게 모든 책을 반납시킬 결심이다!");
	this.talkTextDic_KR.Add(-88, "새로운 파트너가 합류하고 싶어하는 것 같다. 장면 속 봉투를 확인해보자");
	this.talkTextDic_KR.Add(-89, "가련한 금발 소녀가 아직 고집스럽게 저항하고 있다. 정의로운 텐구 기자가 되어 나와 항복하라고 권고한다!");
	this.talkTextDic_KR.Add(-90, "마우스 오른쪽 버튼으로 시점 이동하거나, 마우스 휠로 시야 확대하는 것을 잊지 마라. 이렇게 하면 상황을 더 잘 파악할 수 있다");
	this.talkTextDic_KR.Add(-91, "오래 진행이 막히고 있나? 후퇴하여 더 나은 팀 옵션을 설정해보자 — 다시 도전하면 더 쉬울 수도 있다");
	this.talkTextDic_KR.Add(-92, "자동 저장 간격은 화면 오른쪽 상단에서 조절할 수 있다");
	this.talkTextDic_KR.Add(-93, "레미리아의 빨간 화면 효과가 견디기 힘드나? 화면 오른쪽 상단의 [화면 효과] 옵션을 끌 수 있다");
	this.talkTextDic_KR.Add(-94, "화면 오른쪽 상단에서 설정을 조절할 수 있다. 책 투명도, 탄막 투명도 등을 조절할 수 있다");
	this.talkTextDic_KR.Add(-95, "인형 자원을 현명하게 분배하자 — 뒤에 나타나는 캐릭터일수록 강력하다");
	this.talkTextDic_KR.Add(-96, "인형들 간의 협력을 균형있게 맞추자. 회복량이 입힌 데미지를 초과하면 진행이 막힌다");
	this.talkTextDic_KR.Add(-97, "한 페이즈에 너무 오래 머물면 기리사메의 회복 효율이 계속해서 상승한다 — 화력을 강화하자!");
	this.talkTextDic_KR.Add(-98, "튜토리얼을 완료하기 전까지 후퇴할 수 없다. 조금만 더 견디자!");
	this.talkTextDic_KR.Add(-99, "켄뵤 인형을 너무 많이 만드는 것은 권장하지 않는다. 그렇지 않으면 스테이지 진행이 어려워진다. 스테이지 진행은 집 주변에 흩어진 책의 개수에 달려있다.");
	this.talkTextDic_KR.Add(-111, "기리사메! 빌린 책 언제 돌려줄 거야! 침묵하지 마! 네가 집에 있는 거 알고 있어!");
	this.talkTextDic_KR.Add(-112, "좀 더 오래 빌려쓰는 게 뭐가 문제야? 내가 늙으면 돌려줄게.");
	this.talkTextDic_KR.Add(-113, "또 그 변명이야! 나한테 손대보라고 강요하지 마!\n3……      2……      1……");
	this.talkTextDic_KR.Add(-114, "…… ……");
	this.talkTextDic_KR.Add(-115, "레이무! 이건 이변이다!");
	this.talkTextDic_KR.Add(-116, "여기 모여 뭐 하냐! 흩어져! 흩어져!");
	this.talkTextDic_KR.Add(-117, "기도하고 있어? 아직 할 말이 남았어?");
	this.talkTextDic_KR.Add(-118, "할 말은 더 없다. 재빨리 행동해.");
	this.talkTextDic_KR.Add(-100, "마리사의 집 클릭");
	this.talkTextDic_KR.Add(-101, "클릭하여 알리스 해금");
	this.talkTextDic_KR.Add(-102, "클릭하여 알리스 기능 옵션 확인");
	this.talkTextDic_KR.Add(-103, "봉투 클릭하여 카엔뵤 해금");
	this.talkTextDic_KR.Add(-104, "봉투 클릭하여 홍메이링 해금");
	this.talkTextDic_KR.Add(-105, "상단 관문 진행 바 클릭");
	this.talkTextDic_KR.Add(-106, "홍메이링 인형 또는 칠르노 인형 제작하여 전투력 향상 및 진행 바 진행（진행 바는 집 주변에 흩어진 책의 수량에 따라 결정）");
	this.talkTextDic_KR.Add(-107, "마리사 물리치기");
	this.talkTextDic_KR.Add(-108, "왼쪽 아구를 클릭하여 인형들의 공격 및 회수 효율 확인");
	this.talkTextDic_KR.Add(-109, "상단 퇴각 클릭하여 재시작");
	this.talkTextDic_KR.Add(-110, "초보자 가이드\n________________________________\n");
	this.talkTextDic_KR.Add(0, "게임 시연 버전이 종료되었습니다. 테스트 플레이해 주셔서 감사합니다!\n\n게임은 11월 말 출시 예정이며, 그때 더 많은 캐릭터와 기능을 사용하실 수 있습니다.\n\n만약 저희 게임을 마음에 드셨다면, 위쪽 버튼을 클릭하여 위시리스트에 추가해 주시고 저희를 지원해 주시면 감사하겠습니다.");
	string[] array = new string[]
	{
		"연소", "전격", "군사", "오나바시라", "붉은 안개", "취약", "유령 현상", "저주", "배부름", "시력 강화",
		"용주"
	};
	for (int i = 0; i < array.Length; i++)
	{
		this.itemsTextDic_KR.Add(i, array[i]);
	}
	string[] array2 = new string[]
	{
		"1포인트 데미지를 지속적으로 받음", "2포인트 데미지를 지속적으로 받음", "전역 데미지 100% 증가", "전역 데미지 100% 증가", "전역 데미지 200% 증가", "받는 데미지 50% 상승", "받는 데미지 50% 상승", "받는 데미지 100% 상승", "전역 데미지 50% 증가", "모든 인형이 회피율 12%를 획득합니다",
		"전역 데미지 100% 증가"
	};
	for (int j = 0; j < array2.Length; j++)
	{
		this.itemsTextDic_KR.Add(10000 + j, array2[j]);
	}
	string[] array3 = new string[]
	{
		"앨리스 마르가트로이드", "린 카엔뵤", "홍메이링", "칠르노", "사나에 코치야", "레이센 우동게인 이나바", "아야 샴에이마루", "파추리 노우리지", "유카 야쿠모", "니토리 카와시로",
		"히나 카기야마", "스이카 이부키", "유우카 카자미", "요우무 콘파쿠", "유유코 사이고우지", "사토리 코메이지", "코이시 코메이지", "카나코 야사카", "수와코 모리야", "우츠호 레이우지",
		"에이린 야고코로", "카구야 호라이산", "모쿠오 후지와라", "사쿠야 이자요이", "레미리아 스카렛", "플란도르 스카렛", "묘렌지 사원", "이쿠 나가에", "텐시 히나나비", "코마치 오노즈카",
		"에이키 시키", "미스티아 로렐라", "테위 이나바", "파르시 미즈하시", "시즈하 아키 & 미노리코 아키", "케인 카미시라사와", "코아쿠마", "코스즈 모토오리", "시온 요리가미 & 준 요리가미", "린 사츠키",
		"카센 이바라키", "호쥬우 뉴에", "하타노 코코로"
	};
	for (int k = 0; k < array3.Length; k++)
	{
		this.itemsTextDic_KR.Add(100 + k, array3[k]);
	}
	string[] array4 = new string[]
	{
		"인형 군단", "지옥 기차", "황금 정신", "용사 Cirno", "행운 점표", "확장 탄창", "요괴 Kamaitachi", "도서관의 현자", "현자의 보물고", "지능형 안전 생산 시스템",
		"불운한 금발 어린 소녀", "술주정댄 사람의 마구마구 마시기", "기관총 대두 사수", "유령 사는 저택", "벚꽃 나무 아래의 영혼", "문구멍으로 엿보다", "여동생 모습 이상해", "장엄한 고전장", "돌 개구리 신", "제어 가능한 핵융합",
		"살려줘! Eirin!", "일해라! 공주님!", "젠장, 끝까지 붙자!", "검은 의지", "위엄 있는 밤의 영주", "장난꾸러기 아이들 많아졌어", "앞쪽에 높은 에너지!", "붉은 깃털 옷 드릴", "모든 인류의 비상천", "삼도천 하루 여행"
	};
	for (int l = 0; l < array4.Length; l++)
	{
		this.systemTextDic_KR.Add(200 + l, array4[l]);
	}
	string[] array5 = new string[]
	{
		"초기 상하이 인형 수량 +3, 상하이 인형의 연격 확률 30% 상승", "초기 카엔뵤 인형 수량 +3, 집을 첫 클릭할 때 100 데미지 발생", "홍메이링 인형의 플라이 킥 후퇴 거리 70% 축소, 추가 30% 확률로【오라 펀치】발동. 특별한 이유는 없어, 그냥 너가 그녀를 화나게 했을 뿐", "칠르노가 업그레이드 항목【용사 칠르노】해금. 모든 칠르노 인형의 얼음 창 수량 2.0배 증가. 용사 칠르노라면 분명 이렇게 할 거야", "사나에 인형이 불길籤과 대불길籤을 뽑지 않게 됨. 왜냐면 그녀는 그 쓸모없는 쓰레기籤을 직접 버려버리기 때문", "레이센 인형의 총알 수량 3.0배 증가, 반동 무효화, 동시에 총알이 확산 시작. 그녀가 좌약까지 발사하고 있는 건 아닌지 의심됨", "사명마루 아야의【가마이타치 베일】이 회오리 생성 가능. 이건 멋지고, 책도 더 멀리 날릴 수 있음. 동시에【가마이타치 베일】발동 시간 간격 50% 축소", "진리의 문을 목격하고 대가를 치른 덕분에, 파추리가 업그레이드 항목【현자의 돌】해금", "야쿠모 유카가 현자의 보물고를 개방. 야쿠모 유카 인형의【틈새 사격】지속 시간 100% 연장하지만, 아직 그녀에게 대계 보구를 사용하게 할 정도는 아닌 것 같음", "카와시로 니토리가 업그레이드 항목【과부하】해금, KP-03이 부유포를 소환하여 공격 보조 가능",
		"카기야마 히나 인형의【불운 저주】가 마리사의 책 회수를 막을 수 있음", "거대화한 스이카 인형이 마리사가 회수한 책의 50%를 삼키고, 그 일부를 책 더미로 토해냄. 씻으면 아직 쓸 수 있음", "유우카가 자동으로 태양 에너지를 모아 콩 슈터를 심을 수 있음. 콩 슈터의 발사 총알 수량 +3. 좀비를 때리는 건 아니지만, 이번엔 집을 향해 발사함", "요우무의 돌진이 대상에命中할 때마다 대상에 귀신 착신 상태 부여, 대상이 받는 데미지 50% 상승. 하지만 요우무 자신도 이 유령들을 무서워함", "시체가 말하고 있어? 유유코가 업그레이드 항목【환혼나비】해금, 기타 스킬의 나비 수량 2배 증가", "아직 누가 책을 훔치려고 하는지 보여줘! 코메이지 사토리가 마리사의 집에 더 가까워짐. 각 공격 시 추가로 약점 1개 부여", "코메이지 코이시 인형이 업그레이드 항목【의식 폭주】해금. 동기화율 400% 초과, 코메이지 코이시 재시작!", "카나코의【신앙의 산】이 제공하는 데미지 증폭 200%로 상승. 카나코님, 왜 그냥 보고 계시는 건가요!", "수와코 인형이 4체가 되면【작은 개구리는 비바람을 무서워하지 않는다】가 돌개구리 신상상을 소환 가능, 더 많은 개구리 소환(200%). 매우 폭력적임", "레이우로 쿠우, 대상 추방! 레이우로 쿠우 인형이【핵융합】사용 시 대신 핵폭탄 1발을 던지고, 자신의 다른 공격을 멈추지 않음",
		"에이린! 에이린! 야고코로 에이린이 업그레이드 항목【호라이 산의 약】해금, 화살 수량 2배 증가", "카구야가 부모님 의존을 그만두기로 결정, 알바 전사 형태로 출격. 카구야 인형이【인터넷 요금 납부】없이도 활성화 가능해짐", "모쿠오이 참을 수 없게 된 것 같음. 모쿠오이 업그레이드 항목【불사조의 꼬리】해금, 봉익천상이 대량의 연소 상태 부여 가능", "홍메이링의 피가 정말 잘 맞아. 사쿠야가 너무 신이 나서 더 오래 시간을 멈출 수 있게 됨. 사쿠야가 더 많은 투척 칼을 뿌림", "충분해 사쿠야. 모두에게 밤의 주인의 위엄을 보여줄 시간임. 레미리아가 업그레이드 항목【홍마의 불야성】해금, 박쥐 생성 수량 증가", "한 명의 못된 애는 파괴력이 부족해? 그럼 네 명으로! 플란도르가 업그레이드 항목【금지된 사중 존재】해금", "좌현 포수, 탄막이 너무 얇아! 뭐 하고 있냐! 성련선 파티가 업그레이드 항목【법계의 빛】해금, 동시에 기타 모든 항목의 총알 수량 2배 증가", "내 드릴은 하늘을 뚫는 드릴이야! 나가에 이쿠의【용어 드릴】이 데미지를 주면【연소】와【감전】상태를 소모해 추가 낙뢰 공격 발동 가능", "하늘의 신, 땅의 여자, 사람의 마음! 히나나비 텐시가 업그레이드 항목【전인류의 비상천】해금. 요석이 사라질 때마다 추가 500 지진 데미지 발생", "한번 죽어볼래? 오노즈카 코마치의【망자화 항해】가 대상에 충돌할 때 추가로【사신의 낫】1회 발동"
	};
	for (int m = 0; m < array5.Length; m++)
	{
		this.itemsTextDic_KR.Add(200 + m, array5[m]);
	}
	string[] array6 = new string[]
	{
		"샹하이 인형", "연속 공격", "빠른 재봉", "카엔뵤 인형", "용량 업그레이드", "캣 카트", "속도 업그레이드", "불꽃 걸음", "전력全开", "홍메이링 인형",
		"조흡 기공", "오라 주먹", "무지개 산파 발차기", "칠르노 인형", "얼음 정령의 힘", "절대 영도", "용사 칠르노", "사나에 인형", "바람 소환", "오미쿠지",
		"레이센 인형", "국사무쌍 약", "환상 시차", "롱월 꽃갈피", "아야 인형", "뉴스 조사", "텐구 바람", "가마이타치 베일", "풍신 소녀", "파추리 인형",
		"화신의 빛", "해파리 공주", "다이아 은창", "위성 해바라기", "비취 거석", "현자의 돌", "로열 플레임", "야쿠모 유카 인형", "천", "야쿠모 란",
		"틈새 순간이동", "틈새 사격", "기차 충돌", "카와시로 니토리 인형", "카파 메카", "KP-03 카파 호", "오버로드", "카기야마 히나 인형", "부서진 부적", "불운 저주",
		"스이카 인형", "거대화", "백귀야행", "유우카 인형", "해바라기 필드", "마법 대포", "요우무 인형", "인혼 협력", "미래영갑 단검", "육근청정 단검",
		"유유코 인형", "나비무늬 죽음 창", "화서의 부채", "환혼 나비", "코메이지 사토리 인형", "고속 통찰", "독심술", "코메이지 코이시 인형", "무의식", "도시 전설",
		"의식폭주", "카나코 인형", "확장어주", "신앙의 산", "수와코 인형", "작은 개구리 비바람에 지지 않아", "적구 숭신", "레이우로 쿠우 인형", "제어불능 돌진", "핵융합",
		"에이린 인형", "확산 사격", "야고코 피트니스", "봉래의 약", "카구야 인형", "인터넷 요금 납부", "불사의 몸", "모쿠오 인형", "봉익천상", "불사조의 꼬리",
		"사쿠야 인형", "은의 점프", "시간 정지", "레미리아 인형", "밤의 주인", "궁그닐 신창", "홍마부야성", "플란도르 인형", "레바테인 신검", "눈의 마안",
		"금기의 사중 존재", "성련선 인형", "앵커 배치", "부유 배치", "위광 배치", "법계의 빛", "나가에 이쿠 인형", "용신의 우의", "용어의 드릴", "용궁의 수영탄",
		"텐시 인형", "천벌의 요석", "비상의 검", "전인류의 비상천", "코마치 인형", "사신의 대도", "해안화 항해", "작업 촉진", "단죄", "현인신의 기적",
		"M속성 대폭발", "구운 닭꼬치", "탄구이 야츠메우나기", "야쯔루의 노래", "행운 토끼발-개운대문", "질투 폭발-우시시 참배", "곡물 풍작-가을잎 구운감자", "희미하게-역사 삭제", "희미하게-역사 창조", "악마 빙의-도서 검색",
		"환상 속독-심층 분석", "불운-불운산포", "산재-기러기 지나가면 깃털 빼기", "삭제 잊음", "백약 망주", "파트너-쿠메", "파트너-무츠미", "오니의 팔", "이바라키 카센", "정체불명",
		"???", "???", "정찰 카파", "하타노 코코로 인형"
	};
	for (int n = 0; n < array6.Length; n++)
	{
		this.itemsTextDic_KR.Add(300 + n, array6[n]);
	}
	string[] array7 = new string[] { "测试测试", "一 !", "二 !" };
	for (int num = 0; num < array7.Length; num++)
	{
		this.talkTextDic_KR.Add(9000 + num, array7[num]);
	}
	string[] array8 = new string[]
	{
		"상하이 인형 2개 획득, 대상을 공격함", "각 공격 종료 후, 일정 확률로 즉시 다음 공격 시작", "과거 및 미래에 제작된 모든 상하이 인형의 획득 수량 +1", "카엔뵤 인형 1개 획득, 바닥의 책 회수 가능", "소지한 책의 수량 +1", "소지한 책의 수량 +5", "이동 속도 +10", "이동 속도 +20", "이동 속도 +230", "홍메이링 인형 1개 획득, 플라이 킥으로 공격",
		"호흡을 조절한 뒤 공격하며, 대미지 3.0배로 증가", "각 공격 후 일정 확률로 오라 펀치 공격 발동, 오라 펀치 대미지 상승", "오라 펀치 1회마다 분노 게이지 축적, 분노 게이지 가득 차면 레인보우 산파 발차기 사용 가능, 9.0배 대미지와 함께 자신을 크게 날려버림", "칠르노 인형 1개 획득, 얼음 창 발사로 공격", "공격 방식을 얼음 창 투척으로 변경하되, 해당 기간 동안 여전히 2배 수량의 얼음 창 발사", "공격 시 얼음 기운 축적, 얼음 기운 가득 차면 칠르노 인형이 얼음 구슬로 변해 돌진", "용사 칠르노 인형 1개 획득", "사나에 인형 1개 획득, 공격 불가하되 회오리를 일으켜 바닥의 책을 책 더미로 날림", "회오리가 운반할 수 있는 책의 수량 +1", "각 공격 시 50% 확률로 점치기 수행: 대길-대형 회오리 발생, 길-추가 소형 회오리 1개 생성, 불길-생성된 소형 회오리 1개 감소, 대불길-사나에 인형 쓰러짐",
		"레이센 인형 1개 획득, 총알 발사로 공격", "공격 간격 50% 단축, 각 총알 대미지 +1이지만 공격 시 자신이 뒤로 물러남", "공격을 받을 때 90% 확률로 공격 회피", "월전 베테랑 모드로 전환, 사격 시간 +100%, 뒤로 물러나는 효과 제거", "아야 샴에이마루 인형 1개 획득, 바람탄 발사로 공격", "20회 공격마다 대상에 약점 부여. 마우스로 약점 클릭 시 대량 대미지 발생", "공격이 대상에 명중할 때 일정 확률로 텐구 회오리로 변환, 책을 목적지로 직접 날릴 수 있음", "5초마다 1회, 고속 급강하로 대상 공격, 10.0배 대미지 발생", "아야 인형의 모든 항목 행동 효율 100% 상승", "파추리 인형 1개 획득, 추적 화염구 발사로 공격",
		"공격을 큰 화염구 투척으로 변경, 화염 폭발 유발하여 8.0배 대미지 및 연소 효과 부여 (이 업그레이드 항목 획득 시 기타 항목 취소)", "공격을 거품 발사로 변경, 거품이 대미지를 주고 터진 뒤 더 많은 작은 거품으로 분열하여 대미지 발생 (이 업그레이드 항목 획득 시 기타 항목 취소)", "공격을 은창 3자루 투척으로 변경, 2.0배 대미지 발생 (이 업그레이드 항목 획득 시 기타 항목 취소)", "공격을 나무 원소 2마리 소환하여 서로 둘러싸며 지속적으로 탄막을 뿌리는 방식으로 변경 (이 업그레이드 항목 획득 시 기타 항목 취소)", "비취 거석 3기 땅에서 솟아나게 하여 대상 공격, 2.0배 대미지 발생 (이 업그레이드 항목 획득 시 기타 항목 취소)", "모든 항목 동시 활성화 허용, 동시에 현자의 돌이 탄막을 발사하여 공격 보조", "60초마다 로열 플레임 발동 가능, 400배 대미지 및 연소 효과 부여", "야쿠모 유카 인형 1개 획득, 보라탄 발사로 공격", "청 1마리 소환하여 대상 돌진 공격, 지속적으로 대미지 발생", "야쿠모 란 1마리 소환, 모든 인물에게 군사 상태 부여, 전체 대미지 +100%",
		"틈새를 사용해 카엔뵤 인형 순간 이동, 왕복 달리기 수고 덜기", "4초마다 1회, 틈새 6개 소환하여 2회 사격 수행", "60초마다 1회, 기차 소환하여 대상에 3단 충격 가하기, 450배 대미지 발생", "카와시로 니토리 인형 1개 획득, 물탄 발사로 공격", "카와시로 니토리 인형 1개를 카파 메카로 업그레이드", "카와시로 니토리 인형 1개를 KP-03 카파 호로 업그레이드", "공격 간격 50% 단축하되, 공격 시 바닥의 책 손상 확률 존재", "카기야마 히나 인형 1개 획득, 공격 시 저주 부여", "불운 수집 속도 100% 상승", "마리사의 책 회수 속도 감소",
		"스이카 인형 1개 획득, 거대 돌 들어 올려 투척 공격", "스이카 1마리 거대화, 공격 시 취약 효과 부여하며 동시에 바닥의 책 흡수 후 날려버림", "스이카 1마리가 작은 스이카 3마리로 분열, 공격은 하지 않으나 바닥의 책을 직접 책 더미로 날림", "유우카 인형 1개 획득, 레이저 발사로 공격", "해바라기 심어 태양 에너지 수확, 지속적으로 콩 슈터 생성하여 공격", "마리사의 마법 대포 공격을 받을 때 마법 대포로 반격", "요우무 인형 1개 획득, 대상에게 돌진하여 베기 공격", "등 뒤의 반령이 벚꽃 탄막 발사 가능", "돌진하여 대상에 닿은 후 추가로 다단 베기 공격", "60초마다 1회, 명중한 대상에 낙지 베기 적용, 대량 벚꽃 흩날리며 취약 효과 부여",
		"유유코 인형 1개 획득, 명계 나비 발사로 공격", "보라색 레이저 1발 발사, 동시에 대량 나비 탄막 동반", "부채 펼쳐 지속적으로 대량 나비 탄막 발사", "쓰러졌을 때 부채 펼치며 동시에 대량 레이저와 나비 발사", "코메이지 사토리 인형 1개 획득, 공격 시 약점 부여. 마우스로 약점 클릭 시 대량 대미지 발생", "공격 간격 50% 단축", "모든 공격 회피", "코메이지 코이시 인형 1개 획득, 하트형 공격 수행", "코메이지 코이시 인형이 무의식 영역 확장 가능, 영역 내 모든 인형이 대미지 받지 않음", "공격 모드를 주방 칼로 고속 공격하는 방식으로 변경",
		"코메이지 코이시가 추상화되어 사랑하는 낚시대 휘두르며 맹공격", "카나코 인형 1개 획득, 부적 발사로 공격", "즉시 어주 장착, 하늘에서 대상에 포격 공격 가능", "어주 소환하여 장면 주변에 착지, 모든 동료에게 지속적으로 대미지 증폭 100% 제공", "수와코 인형 1개 획득, 물탄 발사로 공격", "수와코 인형이 대량의 파란 유령 개구리 소환, 사방에서 대상으로 향하며 대상에 닿으면 폭발", "희생된 개구리 수량이 충분해지면 적구 숭신 소환하여 마리사의 집 응시, 지속적으로 저주와 공격 부여", "레이우로 쿠우 인형 1개 획득, 대량 빛 구슬 발사로 공격", "레이우로 쿠우 인형 발사 과열 시 빛 날개 펼쳐 주변 돌진하며 대미지 발생 및 연소 효과 부여", "레이우로 쿠우 인형의 공격 모드를 대상에 부착하여 소형 핵폭발 유발하는 방식으로 변경. 폭발 후 일정 시간 회복 필요",
		"에이린 인형 1개 획득, 화살 발사로 공격", "에이린 인형이 발사하는 화살 수량 100% 증가", "모든 인형이 느리게 체력 회복", "에이린 인형이 쓰러진 동료 구출, 상태 회복 가속", "카구야 인형 1개 획득, 그녀는 별로 의욕이 없어 보임", "카구야 인형 의욕 생김", "카구야 인형은 사망하지 않음", "모쿠오 인형 1개 획득, 불꽃탄 발사로 공격", "모쿠오 인형이 불새로 변身하여 대상 돌진 공격 및 대량 연소 효과 부여", "봉익천상이 대량 연소 효과 부여, 동시에 대상 몸에 걸린 모든 연소 상태 폭발시켜 한번에 모든 대미지 발생",
		"사쿠야 인형 1개 획득, 대량 투척 칼 투척하여 공격", "사쿠야 인형이 대량 떠다니는 투척 칼 소환, 이후 대상으로 향함", "사쿠야 인형의 공격 모드를 시간 정지 후 대상 주변에 대량 투척 칼 배치하는 방식으로 변경", "레미리아 인형 1개 획득, 빨간 바늘탄 발사로 공격", "레미리아 인형이 마법진 불러와 빨간 박쥐 소환하여 돌진 공격", "레미리아 인형이 에너지 축적 후 신창 던져 높은 대미지 발생", "레미리아 인형이 대상 위치로 돌진하여 거대한 빛기둥 공격 발동, 빨간 안개 생성 시작", "플란도르 인형 1개 획득, 근접 공격 수행", "플란도르 인형의 무기를 레바테인으로 변경, 연소 효과 부여", "플란도르 인형의 공격이 모든 약점 자동 발동 가능",
		"현재 장면 내 각 플란도르 인형이 4개로 분열", "성련선 인형 1개 획득, 탄막 발사로 공격", "선원에 무라사 미나미츠 추가, 선체에 유령 닻 등장, 닻 떨어뜨려 공격 가능", "선원에 이치린 쿠모이 추가, 선체에 구름과 구름산 등장, 공격 빈도 상승", "선원에 토라마루 세이 추가, 선체가 바늘 레이저 발사로 공격 가능", "선원에 세이히라쿠 추가, 선체에 빛나라 등장, 대량 탄막 공격 추가", "나가에 이쿠 인형 1개 획득, 전기 구슬 발사로 공격", "나가에 이쿠 인형이 낙뢰 소환하여 대상 공격 및 감전 효과 부여", "나가에 이쿠 인형이 날개의 옷을 드릴로 변경하여 다단 공격 가능", "나가에 이쿠 인형이 구형 번개 방출하여 지속적으로 대미지 발생 및 대량 감전 효과 부여",
		"텐시 인형 1개 획득, 주홍색 바늘탄 발사로 공격", "텐시 인형이 요석 소환하여 떨어뜨려 거대 대미지 발생. 요석이 파괴될 때 다시 거대 대미지 발생", "텐시 인형의 공격 모드를 대상으로 돌진하여 비상의 검으로 난도질하는 방식으로 변경", "텐시 인형이 에너지 축적하여 모든 사람의 기 모으고 거대한 빨간 빛기둥 소환하여 공격", "코마치 인형 1개 획득, 그녀는 또 게을리함", "10초마다 1회, 코마치 인형이 거대한 사신의 낫 휘두르며 공격, 취약 효과 부여", "20초마다 1회, 코마치 인형이 삼도천 나르샤 운전하여 대상 돌진 공격, 대량 대미지 발생 및 취약 효과 부여", "코마치 인형의 휴식 시간 감소, 모든 스킬 쿨타임 [대상 레벨×10%] 감소", "마리사를 한번 더 물리치면 승리 선언 가능", "소환되는 회오리 수량 +1",
		"텐시 인형이 비상의 검으로 집을 베낄 때마다, 집이 [감전] 상태이면 텐시 인형이 집의 전류에 감전. 좀 쾌감 있어서 베는 속도 점점 빨라지지만 전류 소모 (감전 상태 1초마다 스킬 쿨타임 10% 감소, 최대 80%까지)", "재료(닭고기+파) 소모하여 구운 닭꼬치 제조 및 [만복] 상태 획득 (전체 대미지 +50%)", "재료(야츠메우나기+버섯) 소모하여 탄구이 야츠메우나기 제조 및 [명목] 상태 획득 (모든 인형 회피율 +12%)", "마리사의 공격 속도 50% 감소", "마우스 클릭 시 크리티컬 대미지 확률 존재 (확률 +5%), 크리티컬 대미지 상승 (+10)", "약점 대미지 20% 상승", "모든 인형의 체력 10% 상승", "10초마다 1회, 마우스 위치에 5초간 지속되는 역사 삭제 영역 생성, 마리사의 탄막이 닿으면 삭제 가능", "역사 삭제할 때마다 마우스 위치에 삭제된 탄막 발사, 마리사에게 대미지 발생", "코아쿠마가 마우스에 부착, 마리사의 집 클릭할 때마다 즉시 책 회수 (회수 수량 +1)",
		"회수한 모든 책의 가치 +1", "마리사의 회수 효율 10% 감소", "마리사가 갑자기 아파지며 초당 대미지 +100 받음", "(Error)", "자신의 체력 지속 회복, 공격력 +10", "대형 독수리 소환하여 공격", "레이쥬의 도움 받아 공격을 번개로 변경, 감전 효과 부여", "그림자 화산 부채 소환하여 전투 보조. 다시 하나가 되자!", "화산이 오니의 팔과 하나가 되어 오니 화산 부채로 변몸. 속성과 공격 능력은 다른 여러 업그레이드 항목에 따라 결정됨. 내 팔을 되찾았어. 어떻게 질 수 있겠어!", "???",
		"???", "???", "정찰 카파 인형 지원을 받는다. 그들은 적을 공격하지 않고, 마리사가 던지는 병과 팔괘로를 격추한다.", "코코로 인형을 획득한다. [F1] 키를 누르면 직접 코코로 인형을 조종하여 공격할 수 있으며, 영력을 충전한 후 [F][Q][E][R] 키를 눌러 스킬을 발동할 수 있다. 코코로 인형은 스테이지 진행에 따라 자신을 강화한다"
	};
	for (int num2 = 0; num2 < array8.Length; num2++)
	{
		this.itemsTextDic_KR.Add(20300 + num2, array8[num2]);
	}
	this.itemsTextDic_KR[421] = "계란말이";
	this.itemsTextDic_KR[20421] = "재료（계란＋파）를 소모하여 계란말이를 만들고 [만복] 상태를 획득한다.（전체 데미지＋50%）";
	this.itemsTextDic_KR[20352] = "1마리의 수이카가 무수한 미니 수이카로 분열한다. 공격하지 않고, 대신 땅에 있는 책을 직접 책 더미에 던진다";
	this.itemsTextDic_KR[20424] = "마우스 왼쪽 클릭으로 크리티컬 데미지를 입힐 확률이 상승（확률＋10%）, 크리티컬 데미지 값도 상승（＋10）";
	this.itemsTextDic_KR.Add(444, "자동 수집");
	this.itemsTextDic_KR.Add(20444, "재료가 사라질 때 자동으로 수집됩니다");
	this.itemsTextDic_KR[20315] = "공격 시 얼음 기운을 축적한다. 가득 차면 칼노 인형이 얼음 공으로 변해 돌진하며, 목표 위치에 얼음 안개를 방출해「취약」을 부여한다.";
	this.itemsTextDic_KR[20351] = "1마리의 수이카가 거대해지며, 그 공격은「취약」을 부여할 수 있다.";
	this.itemsTextDic_KR[20346] = "공격 간격이 50% 단축됩니다";
	string[] array9 = new string[]
	{
		"", "Alice의 집을 클릭하면 튜토리얼을 시작할 수 있습니다.", "이곳은 작전 회의 화면입니다. 여기서 다양한 프로젝트를 선택하여 활성화하면 지원 효과를 얻을 수 있습니다. 회의 프로젝트는 게임 진행 중 단계를推进하며 해금해야 하며, 지금은 먼저 게임에 직접 진입하겠습니다.", "Marisa의 집 현관에 오신 것을 환영합니다! 집 안에 단속적으로 있는 Marisa는 책을 찾아온 Alice를 격분시켰습니다. Alice를 지원하여 함께 책을 되찾아 주세요!", "마우스 왼쪽 버튼으로 Marisa의 집을 클릭할 때마다 대미지를 입히고 책을 떨어뜨릴 수 있습니다.", "잘 했어요! Marisa에게 책 1권을 토해내게 하는 데 성공했습니다. 하지만 클릭으로 인한 대미지는 매우 제한적이에요. Alice를 클릭해서 그녀가 해결책이 있는지 확인해 보세요.", "Alice가 자신의 샹하이 인형(Shanghai Dolls)을 가져왔습니다. 이 인형들은 자동으로 공격해 주기 때문에, 이제부터 손을 놓고도 괜찮습니다!", "하지만 현재 인형 수로는 모든 책을 되찾기에 충분하지 않습니다. 다시 Alice를 클릭해서 더 많은 인형을 소환해 도와달라고 해보세요.", "Alice의 대화 옵션에서 프로젝트를 클릭하면 더 많은 인형을 생산할 수 있습니다. 하지만 분명히 인형을 만드는 데 필요한 자원(책)이 부족합니다. 화면 왼쪽 상단을 확인해 주세요 — 여기서 자원 수량을 볼 수 있습니다.", "Alice 옆에 있는 봉투를 보이세요? 이것은 Alice가 소집한 파트너가 지원하기 위해 온 것입니다. Marisa의 책 훔치기 행위에 모두 불만을 가지고 있는 것 같아요. 봉투를 클릭해서 어떤 파트너인지 확인해 보세요!",
		"Kaenbyou Rin이 자신의 켄비요 린 인형(Kaenbyou Rin Dolls)을 가져왔습니다. 이 인형들은 땅에 흩어진 책을 수집해서 자원으로 변환해 주고, 켄비요 린 인형을 클릭하면 그들의 작업 속도를 높일 수 있습니다. 이제 더 많은 인형을 생산하기 위한 자원이 충분해질 거예요! 다른 봉투도 있는 것 같아서, 빨리 확인해 보세요.", "Hong Meiling이 지원하기 위해 왔어요! 구원됐습니다! 샹하이 인형(Shanghai Dolls)을 다른 캐릭터의 인형으로 변환할 수 있으며, 이 인형들은 보통 샹하이 인형보다 더 강한 능력을 가지고 있습니다. 샹하이 인형이 부족할 때는 Alice에게 가서 더 생산하는 걸 잊지 마세요.", "화면 상단의 진행률 바에 눈치챘어요? 격파된 책이 땅에 너무 많이 쌓이면 진행률 바가 차기 시작합니다. Marisa는 이렇게 많은 책을 당신이 가져가는 걸 허락하지 않을 거예요 — 진행률 바가 가득 차면 Marisa가 직접 나와서 책을 회수하며, 이때 BOSS 전투가 시작됩니다.", "인형의 전투력을 향상시켜 Marisa를 유인하기에 충분한 책을 땅에 쌓아보세요. 그 동안 마우스 오른쪽 버튼을 누른 채로 시야를 이동할 수 있고, 마우스 휠로 시야를 확대하거나 축소할 수 있습니다.", "마침내 Marisa가 참지 못하고 나타났어요! 이것은 좋은 기회입니다! 지금 당장 그녀를 물리치세요!", "Marisa의 저항이 예상보다 강한 것 같아서, 우리 인형들 중 일부가 피해를 입었습니다. 하지만 걱정하지 마세요 — 이 인형들은 Alice의 마법으로 움직이기 때문에, 시간만 있다면 스스로 회복할 거예요. Marisa에게는 승산이 없어요!", "Marisa가 도망쳤어요! 하지만 집 안으로 도망가 버렸습니다. 그녀를 복제하지 못한 건 아쉽지만, 낙담하지 마세요 — Marisa가 도망치면서 남긴 별(자원)을 얻었습니다. 이 마법이 가득한 별을 사용해서 인형들을 업그레이드해 주세요!", "이제 새로운 단계로 진입합니다. 새로운 단계에서는 더 많은 지원을 받을 수 있으며, 그 봉투들을 클릭해서 새로운 파트너를 맞이해 주세요! 한편, 왼쪽에서 Akyu가 어떤 도움을 줄 수 있는지 확인해 보세요.", "Akyu가 이 작전의 기록을 맡고 있습니다. 여기서 모든 사람의 공격 효율과 책 회수 효율을 볼 수 있습니다.", "이 중에서 특히 주의해야 할 점은, 2단계부터 시작해서 교활한 Marisa가 지속적으로 책을 회수하기 시작한다는 것입니다. 한 단계에서 시간을 길게 끌면 Marisa의 회수 속도가 빨라집니다.",
		"주의하세요 — 책을 되찾는 속도가 Marisa의 회수 속도에 미치지 못하면 작전은 기본적으로 실패로 끝납니다. 이때는 화면 상단의 철수 버튼(Retreat)을 클릭해서 Alice의 집으로 돌아가 작전 회의를 재수립하고, 새로운讨伐를 조직하세요.", "튜토리얼은 여기서 끝입니다. 이미 많은 시간을 낭비했으니, 먼저 한 번 물러나고 다시 와보세요.", "새로운 단계에 처음으로 성공적으로 진입할 때마다 영구적으로 1개의 회의 포인트를 얻을 수 있습니다. 이를 적절히分配해서 인형들을 강화해 주세요. 언제든지 [TAB] 키를 눌러 회의 내용을 열 수 있습니다."
	};
	for (int num3 = 1; num3 < array9.Length; num3++)
	{
		this.talkTextDic_KR.Add(num3, array9[num3]);
	}
}
